software.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Software</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://www.w3schools.com/w3css/4/w3.css" /> 
<link rel="stylesheet" type="text/css" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.2/css/all.min.css"> 
<link rel="stylesheet" href="style.css" /> 
<link rel="stylesheet" href="talks.css" />
</head>
<body>
<div id="preamble" class="status">
<div class="w3-top w3-white topbar" >
<div class="w3-topbar w3-border-indigo w3-white" >
<div class="w3-container w3-bar w3-border-bottom" >
<a class="w3-bar-item w3-button w3-large w3-hover-none w3-text-indigo" href="/" >
<b >
THIBAUT BENJAMIN
</b>
</a><a class="w3-bar-item w3-button w3-large w3-hover-none w3-border-white w3-bottombar w3-hover-border-indigo w3-right w3-hide-small w3-hide-medium" href="software.html" >
Software
</a>
<a class="w3-bar-item w3-button w3-large w3-hover-none w3-border-white w3-bottombar w3-hover-border-indigo w3-right w3-hide-small w3-hide-medium" href="talks.html" >
Talks
</a>
<a class="w3-bar-item w3-button w3-large w3-hover-none w3-border-white w3-bottombar w3-hover-border-indigo w3-right w3-hide-small w3-hide-medium" href="research.html" >
Research
</a>
<a class="w3-bar-item w3-button w3-large w3-hover-none w3-border-white w3-bottombar w3-hover-border-indigo w3-right w3-hide-small w3-hide-medium" href="index.html" >
Home
</a><div class="hamburger-menu w3-hide-large" >
<input id="menu__toggle" type="checkbox" />
             <label class="menu__btn" for="menu__toggle">
             <span></span>
             </label>

<ul class="menu__box" >
<li ><a class="menu__item" href="index.html" >Home</a></li>

<li ><a class="menu__item" href="research.html" >Research</a></li>

<li ><a class="menu__item" href="talks.html" >Talks</a></li>

<li ><a class="menu__item" href="software.html" >Software</a></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="content" class="content w3-container">
<h1 class="title">Software</h1>
<div class="w3-row" >
<div class="w3-col s1 m1 l1" >
&nbsp;
</div><div class="w3-col s10 m10 l10" >

<div id="outline-container-orgb20e2d6" class="outline-1">
<h1 id="orgb20e2d6">Software development</h1>
<div class="outline-text-1" id="text-orgb20e2d6">
</div>
<div id="outline-container-orgd2724ab" class="outline-2">
<h2 id="orgd2724ab">Research related contribution</h2>
<div class="outline-text-2" id="text-orgd2724ab">
</div>
<div id="outline-container-org5250de6" class="outline-3">
<h3 id="org5250de6">Frama-C</h3>
<div class="outline-text-3" id="text-org5250de6">
<p>
Between 2021 and 2023, I developped on the open-source <a href="https://frama-c.com/">Frama-C</a> software which gives a framework for combining different formal methods for verifying C programs. I mostly work in the <a href="https://frama-c.com/fc-plugins/e-acsl.html">E-ACSL</a> plugin dedicated to runtime assertion checking. My work in this plugin consists in improving on the performance of the generated code, especially for arithmetic annotations in the presence of logic functions via a static analysis. This analysis based on interval arithmetic is quite involved when recursive functions are used.
</p>
<span class="w3-bar infobar" >
<a class="w3-bar-item w3-button w3-hover-none w3-large" href="https://git.frama-c.com/pub/frama-c" >
<i class="fa-brands fa-gitlab" >

</i>
</a>
</span>
</div>
</div>

<div id="outline-container-org8e01d96" class="outline-3">
<h3 id="org8e01d96">CaTT- An infinity categorical coherence typechecker</h3>
<div class="outline-text-3" id="text-org8e01d96">
<p>
CaTT is a dependent type theory whose models are the weak &omega;-categories. It is implemented in OCaml and I also host an interactive online version available for quick tests
</p>
<span class="w3-bar infobar" >
<a class="w3-bar-item w3-button w3-hover-none w3-large" href="https://github.com/thibautbenjamin/catt" >
<i class="fa-brands fa-github" >

</i>
</a>
<a class="w3-bar-item w3-button w3-hover-none w3-large" href="https://thibautbenjamin.github.io/catt/" >
<i class="fa-solid fa-terminal" >

</i>
</a>
</span>
</div>
</div>


<div id="outline-container-orgc5afc16" class="outline-3">
<h3 id="orgc5afc16">CaTT-Formalization</h3>
<div class="outline-text-3" id="text-orgc5afc16">
<p>
An Agda formalization of the type theory CaTT, as a special case of a framework that I call free globular type theories. This provides a certified interpreter for the bare language CaTT (without syntactic sugar), as well as a setup to prove properties such as decidability of type checking, uniqueness of derivations, and all the lemma on which the categorical analysis of the theory relies.
</p>
<span class="w3-bar infobar" >
<a class="w3-bar-item w3-button w3-hover-none w3-large" href="https://github.com/thibautbenjamin/catt-formalization" >
<i class="fa-brands fa-github" >

</i>
</a>
</span>
</div>
</div>


<div id="outline-container-org698a070" class="outline-3">
<h3 id="org698a070">Formalization of representation of symmetric groups</h3>
<div class="outline-text-3" id="text-org698a070">
<p>
During a research internship under the supervision of <a href="https://www.lri.fr/~hivert/">Florent Hivert</a>, I have formalized the computation of the representations of the symmetric groups and their characters using Young tableaux, in Coq with ssreflect (now MathComp). This project has been integrated into <a href="https://github.com/hivert/Coq-Combi">Florent’s development</a> of algebraic combinatorics.
</p>
<span class="w3-bar infobar" >
<a class="w3-bar-item w3-button w3-hover-none w3-large" href="https://github.com/thibautbenjamin/ReprSymGroup" >
<i class="fa-brands fa-github" >

</i>
</a>
</span>
</div>
</div>
</div>


<div id="outline-container-org914b900" class="outline-2">
<h2 id="org914b900">Artifacts for submitted articles</h2>
<div class="outline-text-2" id="text-org914b900">
</div>
<div id="outline-container-orgb73e109" class="outline-3">
<h3 id="orgb73e109">Benchmark for abstract interpretation of recursive functions in E-ACSL</h3>
<div class="outline-text-3" id="text-orgb73e109">
<p>
Here you can find the source files and the script we used to benchmark the article on abstract interpretation of recursive function in E-ACSL, along with the version of Frama-C and E-ACSL that we ran the benchmarks on.
</p>
<span class="w3-bar infobar" >
<a class="w3-bar-item w3-button w3-hover-none w3-large" href="https://thibautbenjamin.github.io/software/benchmarks-tap23.zip" >
benchmarks
</a>
<a class="w3-bar-item w3-button w3-hover-none w3-large" href="https://thibautbenjamin.github.io/software/frama-c-tap23.zip" >
frama-c/e-acsl
</a>
</span>
</div>
</div>
</div>


<div id="outline-container-org9ab7280" class="outline-2">
<h2 id="org9ab7280">Other contribution</h2>
<div class="outline-text-2" id="text-org9ab7280">
</div>
<div id="outline-container-orgaaee66b" class="outline-3">
<h3 id="orgaaee66b">OcaEmu</h3>
<div class="outline-text-3" id="text-orgaaee66b">
<p>
An emulator for the i8080 chip and the space invaders arcade machine written in OCaml.
</p>
<span class="w3-bar infobar" >
<a class="w3-bar-item w3-button w3-hover-none w3-large" href="https://github.com/thibautbenjamin/OcaEmu" >
<i class="fa-brands fa-github" >

</i>
</a>
</span>
</div>
</div>
</div>
</div>

</div><div class="w3-col s1 m1 l1" >
&nbsp;
</div>
</div></div>
<div id="postamble" class="status">
<footer class="w3-footer w3-center w3-white w3-border-top" >
<div class="w3-container w3-text-gray" >
THIBAUT BENJAMIN,&emsp;Research Associate in computer science at University of Cambridge
</div><div class="w3-bar" >
<div class="w3-bar-item w3-button w3-hover-none" >
<a href="cv.pdf" >
<i class="fa-solid fa-file-lines" >

</i>
</a><a href="cv.pdf" >
cv
</a>
</div>
<div class="w3-bar-item w3-button w3-hover-none" >
<a href="mailto:thibaut.benjamin@polytechnique.edu" >
<i class="fa-solid fa-envelope" >

</i>
</a><a href="mailto:thibaut.benjamin@polytechnique.edu" >
email
</a>
</div>
<div class="w3-bar-item w3-button w3-hover-none" >
<a href="http://www.github.com/thibautbenjamin" >
<i class="fa-brands fa-github" >

</i>
</a><a href="http://www.github.com/thibautbenjamin" >
thibautbenjamin
</a>
</div>
<div class="w3-bar-item w3-button w3-hover-none" >
<a href="https://www.researchgate.net/profile/Thibaut-Benjamin" >
<i class="fa-brands fa-researchgate" >

</i>
</a><a href="https://www.researchgate.net/profile/Thibaut-Benjamin" >
Thibaut Benjamin
</a>
</div>
<div class="w3-bar-item w3-button w3-hover-none" >
<a href="https://orcid.org/0000-0002-9481-1896" >
<i class="fa-brands fa-orcid" >

</i>
</a><a href="https://orcid.org/0000-0002-9481-1896" >
0000-0002-9481-1896
</a>
</div>
</div><p class="footer" >
Copyright (c) 2024 Thibaut Benjamin
</p>
</footer>
</div>
</body>
</html>
